#-----------------------------------------------------------------------------------------------
# 제어문 - 반복문과 break
# - 중첩 반복문일 경우 break는 가장 가까이 있는 반복문만 종료 
#-----------------------------------------------------------------------------------------------
## [실습] 단의 숫자만큼만 구구단 출력하세요.
## 2*1=2 2*2=4
## 3*1=3 ....
#-----------------------------------------------------------------------------------------------

for i in range(2,10):
    print(i,'단',end=' ')
    for j in range(1,10):
        if j<=i:
            print(f'{i}*{j}={i*j:<2}',end=' ')
        else:
            print()
            break


for i in range(2,10):
    print(f'\n[{i}단]',end='  ')
    for n in range(1,10):
        print(f'{i}*{n}={i*n}',end='  ')
        if n==i:
            break
    print("outer for")



## [중첩반복문] 내부 반복문 종료시 외부 반복문 종료-------------------------------
## - 내부 반복문 종료여부를 변수 저장
## - 외부 반복문에서는 내부 반복문이 종료되면 함께 종료
#-----------------------------------------------------------------------------------------------
isbreak=False
for d in range(2,10):
    print(f'\n[{d}단]',end='  ')
    for n in range(1,10):
        print(f'{d}*{n}={d*n}',end='  ')
        if n==d:
            isbreak=True
            break
    if isbreak: break



# break없이도 가능!
dan=5
for d in range(2,dan+1):
    print(f'\n[{d}단]',end='  ')
    for n in range(1,d+1):
         print(f'{d}*{n}={d*n}',end='  ')

