#-----------------------------------------------------------------------------------------------
# [실습] 숫자를 입력 받아서 음이 아닌 정수와 음수 구분하기
#-----------------------------------------------------------------------------------------------
num=int(input('숫자를 입력하시오. :'))
if num>=0:
    print(f'숫자 {num}은 음이 아닌 정수입니다.')
else:
    print(f'숫자 {num}은 음수입니다.')

#-----------------------------------------------------------------------------------------------
# [실습] 점수를 입력 받아서 합격과 불합격 출력
# - 합격 : 60점 이상
#-----------------------------------------------------------------------------------------------
jumsu=int(input('점수를 입력 하시오. :'))
if jumsu>=60:
    print("합격입니다.")
else:
    print('불합격입니다.')

#-----------------------------------------------------------------------------------------------
# [실습] 점수를 입력 받아서 학점 출력
# - 학점 : A, B, C, D, F
#-----------------------------------------------------------------------------------------------
jumsu1=int(input('점수를 입력 하시오. :'))
if jumsu1>=90:
    print('학점은 A입니다.')
elif jumsu1>=80:
    print('학점은 B입니다.')
elif jumsu1>=70:
    print('학점은 C입니다.')
elif jumsu1>=60:
    print('학점은 D입니다.')
else:
    print('학점은 F입니다.')



