#-----------------------------------------------------------------------------------------------
# 사용자  정의 함수 -실습 
#-----------------------------------------------------------------------------------------------
# 함수 기능 : 원하는 단의 구구단을 출력해주는 기능 함수
# 함수 이름 : gugudan
# 매개 변수 : gugu
# 함수 결과 : none
# ------------------------------------------------------------------------------------------------
def gugudan(gugu):
    print(f'{gugu}단')
    for i in range(1,10):
        print(f'{gugu}*{i}={gugu*i}')
    return

gugudan(7)

#------------------------------------------------------------------------------------------------
# 함수 기능 : 파일의 확장자를 반환해주는 함수
# 함수 이름 : extention
# 매개 변수 : file_name
# 함수 결과 : none
#------------------------------------------------------------------------------------------------
def extention(file_name):
    idx=file_name.rfind('.')
    return file_name[idx+1:]

print(extention('asdfasdgsdg.txt'))





