Idol_list={'R.ef':[1995,'보이그룹',{'멤버':['박철우','성대현','이성욱']}],
           '터보':[1995,'보이그룹',{'멤버':['김정남','김종국','마이키']}],
           '클론':[1996,'보이그룹',{'멤버':['구준엽','강원래']}],
           'H.O.T':[1996,'보이그룹',{'멤버':['문희준','장우혁','토니안','강타','이재원']}],
           '젝스키스':[1997,'보이그룹',{'멤버':['은지원','이재진','김재덕','장수원']}],
           'NRG':[1997,'보이그룹',{'멤버':['이성진','천명훈','노유민','문성훈','김환성']}],
           '태사자':[1997,'보이그룹',{'멤버':['김형준','이동윤','박준석','김영민']}],
           '신화':[1998,'보이그룹',{'멤버':['에릭','이민유','김동완','신헤성','전진','앤디']}],
           '비비':[1997,'걸그룹',{'멤버':['채소연','윤이지']}],
           'SES':[1997,'걸그룹',{'멤버':['바다','유진','슈']}],
           '디바':[1997,'걸그룹',{'멤버':['채리나','비키','지니','이민경']}],
           '베이비복스':[1997,'걸그룹',{'멤버':['김이지','이희진','심은진','간미연','윤은혜']}],
           '핑클':[1998,'걸그룹',{'멤버':['이효리','옥주현','이진','성유리']}],
           '룰라':[1994,'혼성그룹',{'멤버':['이상민','김지현','채리나']}],
           '쿨':[1994,'혼성그룹',{'멤버':['김성수','이재훈','유리']}],
           '영턱스클럽':[1996,'혼성그룹',{'멤버':['임성은','최승민','박성현','송진아','한현남']}],
           '샵':[1998,'혼성그룹',{'멤버':['지혜','석현','크리스','지영']}],
           '코요태':[1998,'혼성그룹',{'멤버':['김종민','신지','빽가']}],
           'god':[1999,'보이그룹',{'멤버':['박준형','윤계상','데니안','손호영','김태우']}],
           'Y2K':[1999,'보이그룹',{'멤버':['고재근','마츠오 유이치','마츠오 코지']}],
           '클릭비':[1999,'보이그룹',{'멤버':['우연석','김태형','오종혁','김상혁','하현곤','유호석','노민혁']}],
           '플라이투더스카이':[1999,'보이그룹',{'멤버':['브라이언','환희']}],
           '량현량하':[2000,'보이그룹',{'멤버':['량현','량하']}],
           'UN':[2000,'보이그룹',{'멤버':['김정훈','최정원']}],
           'JTL':[2001,'보이그룹',{'멤버':['이재원','토니안','장우혁']}],
           '제이워크':[2002,'보이그룹',{'멤버':['이재진','김재덕']}],
           '블랙비트':[2002,'보이그룹',{'멤버':['황상훈','이소민','장진영','정지훈','심재원']}],
           '악동클럽':[2002,'보이그룹',{'멤버':['임대석','정이든','이태근','권세은','정윤돈']}],
           '클레오':[1999,'걸그룹',{'멤버':['채은정','구도경','디니']}],
           '애즈원':[1999,'걸그룹',{'멤버':['크리스탈','이민']}],
           '샤크라':[2000,'걸그룹',{'멤버':['황보','려원','보나','은']}],
           '파파야':[2000,'걸그룹',{'멤버':['강세정','조혜경','주연정']}],
           '쥬얼리':[2001,'걸그룹',{'멤버':['김은정','서인영','김예원','하주연','박정아','윤진솔','이지현']}],
           '밀크':[2001,'걸그룹',{'멤버':['박희본','김보미','배유미','서현진']}],
           '슈가':[2001,'걸그룹',{'멤버':['아유미','황정음','육혜승','박수진','이하린']}],
           '거북이':[2001,'혼성그룹',{'멤버':['터틀맨','지이','금비']}],
           '더자두':[2001,'혼성그룹',{'멤버':['자두','강두']}],
           '동방신기':[2003,'보이그룹',{'멤버':['최강창민','유노윤호']}],
           '슈퍼주니어':[2005,'보이그룹',{'멤버':['이특','희철','예성','신동','은혁','시원','동해','려욱','규현']}],
           'SS501':[2005,'보이그룹',{'멤버':['김현중','허영생','김규종','박정민','김형준']}],
           '빅뱅':[2006,'보이그룹',{'멤버':['탑','태양','지드래곤','대성']}],
           '샤이니':[2008,'보이그룹',{'멤버':['온유','종현','KEY','민호','태민']}],
           '2AM':[2008,'보이그룹',{'멤버':['정진운','조권','이창민','임슬옹']}],
           '2PM':[2008,'보이그룹',{'멤버':['JUN.K','닉쿤','택연','우영','준호','찬성']}],
           '천상지희':[2005,'걸그룹',{'멤버':['린아','다나','선데이','스테파니']}],
           '브라운아이드걸스':[2006,'걸그룹',{'멤버':['제아','미료','나르샤','가인']}],
           '원더걸스':[2007,'걸그룹',{'멤버':['유빈','예은','선미','혜림']}],
           '카라':[2007,'걸그룹',{'멤버':['박규리','한승연','니콜','구하라','강지형','허영지']}],
           '소녀시대':[2007,'걸그룹',{'멤버':['태연','써니','티파니','효연','유리','수영','윤아','서현']}],
           '비스트':[2009,'보이그룹',{'멤버':['윤두준','용준형','양요섭','이기광','손동운']}],
           '엠블랙':[2009,'보이그룹',{'멤버':['승호','지오','미르']}],
           '씨앤블루':[2010,'보이그룹',{'멤버':['정용화','강민혁','이정신']}],
           '인피니트':[2010,'보이그룹',{'멤버':['김성규','장동우','남우현','이성열','엘','이성종']}],
           '제국의아이들':[2010,'보이그룹',{'멤버':['케빈','황광희','임시완','문준영','김태헌','정희철','하민우','박형식','김동준']}],
           '틴탑':[2010,'보이그룹',{'멤버':['천지','니엘','리키','창조']}],
           'B1A4':[2011,'보이그룹',{'멤버':['신우','산들','공찬']}],
           '블락비':[2011,'보이그룹',{'멤버':['태일','비범','재효','유권','박경','지코','피오']}],
           '2NE1':[2009,'걸그룹',{'멤버':['박봄','산다라박','CL','공민지']}],
           '포미닛':[2009,'걸그룹',{'멤버':['남지현','허가윤','전지윤','현아','권소현']}],
           '애프터스쿨':[2009,'걸그룹',{'멤버':['가희','정아','소영','주연','베카','유이','레이나','나나','리지','이영','가은']}],
           '티아라':[2009,'걸그룹',{'멤버':['큐리','은정','효민','지연']}],
           'f(x)':[2009,'걸그룹',{'멤버':['빅토리아','엠버','루나','크리스탈']}],
           '시크릿':[2009,'걸그룹',{'멤버':['전효성','정하나','송지은']}],
           '미쓰에이':[2010,'걸그룹',{'멤버':['페이','지아','민','수지']}],
           '걸스데이':[2010,'걸그룹',{'멤버':['소진','유라','민아','혜리']}],
           '씨스타':[2010,'걸그룹',{'멤버':['보라','효린','소유','다솜']}],
           '에이핑크':[2010,'걸그룹',{'멤버':['박초롱','윤보미','정은지','김남주','오하영']}],
           '브레이브걸스':[2011,'걸그룹',{'멤버':['민영','유정','은지','유나']}],
           '트러블메이커':[2011,'혼성그룹',{'멤버':['장현승','현아']}],
           'B.A.P':[2012,'보이그룹',{'멤버':['방용국','정대현','유영재','문종업']}],
           '비투비':[2012,'보이그룹',{'멤버':['서은광','이민혁','이창섭','임현식','프니엘','육성재']}],
           '엑소':[2012,'보이그룹',{'멤버':['시우민','수호','백현','첸','찬열','디오','카이','세훈']}],
           '빅스':[2012,'보이그룹',{'멤버':['엔','레오','켄','혁']}],
           '방탄소년단':[2013,'보이그룹',{'멤버':['진','슈가','제이홉','RM','지민','뷔','정국']}],
           '위너':[2014,'보이그룹',{'멤버':['강승윤','김진우','송민호','이승훈']}],
           '몬스타엑스':[2015,'보이그룹',{'멤버':['셔누','민혁','기현','형원','주헌','아이엠']}],
           '데이식스':[2015,'보이그룹',{'멤버':['영케이','성진','원필','도운']}],
           '세븐틴':[2015,'보이그룹',{'멤버':['에스쿱스','정한','조슈아','준','호시','원우','우지','디에잇','민규','도겸','승관','버논','디노']}],
           '아스트로':[2016,'보이그룹',{'멤버':['MJ','진진','차은우','문빈','윤산하']}],
           '하이라이트':[2017,'보이그룹',{'멤버':['윤두준','양요섭','이기광','손동운']}],
           '워너원':[2017,'보이그룹',{'멤버':['윤지성','하성운','황민현','옹성우','김재환','강다니엘','박지훈','박우진','배진영','이대휘','라이관린']}],
           '더보이즈':[2017,'보이그룹',{'멤버':['상연','제이콥','영훈','현재','주연','케빈','뉴','큐','주학년','선우','에릭']}],
           'EXID':[2012,'걸그룹',{'멤버':['솔지','ELLY','하니','혜린','정화']}],
           'AOA':[2012,'걸그룹',{'멤버':['혜정','설현','찬미']}],
           '마마무':[2014,'걸그룹',{'멤버':['솔라','문별','휘인','화사']}],
           '레드벨벳':[2014,'걸그룹',{'멤버':['아이린','슬기','웬디','조이','예리']}],
           '러블리즈':[2014,'걸그룹',{'멤버':['베이비소울','유지애','서지수','이미주','Kei','Jin','류수정','정예인']}],
           '여자친구':[2015,'걸그룹',{'멤버':['소원','예린','은하','유주','신비','엄지']}],
           '오마이걸':[2015,'걸그룹',{'멤버':['효정','미미','유아','승희','유빈','아린']}],
           '트와이스':[2015,'걸그룹',{'멤버':['나연','정연','모모','사나','지효','미나','다현','채영','쯔위']}],
           '우주소녀':[2016,'걸그룹',{'멤버':['설아','보나','엑시','수빈','루다','다원','은서','여름','다영','연정']}],
           '블랙핑크':[2016,'걸그룹',{'멤버':['지수','제니','로제','리사']}],
           '모모랜드':[2016,'걸그룹',{'멤버':['혜빈','제인','나윤','주이','아인','낸시']}],
           '스트레이키즈':[2017,'보이그룹',{'멤버':['방찬','리노','창빈','현진','한','필릭스','승민','아이엔']}],
           '에이티즈':[2018,'보이그룹',{'멤버':['성화','홍중','윤호','여상','산','민기','우영','종호']}],
           '부석순':[2018,'보이그룹',{'멤버':['승관','도겸','호시']}],
           '원어스':[2019,'보이그룹',{'멤버':['서호','이도','건희','환웅','시은']}],
           '투모로우바이투게더':[2019,'보이그룹',{'멤버':['연준','수빈','범규','태현','휴닝카이']}],
           '프로미스나인':[2017,'걸그룹',{'멤버':['이새롬','송하영','박지원','노지선','이서연','이채영','이나경','백지헌']}],
           '(여자)아이들':[2018,'걸그룹',{'멤버':['미연','민니','소연','우기','슈화']}],
           '아이즈원':[2018,'걸그룹',{'멤버':['권은비','사쿠라','강혜원','최예나','이채연','김채원','김민주','나코','히토미','조유리','안유진','장원영']}],
           'ITZY':[2019,'걸그룹',{'멤버':['예지','리아','류진','채령','유나']}],
           '엔하이픈':[2020,'보이그룹',{'멤버':['정원','희승','제이','제이크','성훈','선우','니키']}],
           '보이넥스트도어':[2023,'보이그룹',{'멤버':['성호','리우','명재현','태산','이한','윤학']}],
           '제로베이스원':[2023,'보이그룹',{'멤버':['예준','노아','밤비','은호','하민']}],
           '플레이브':[2023,'보이그룹',{'멤버':['멤1','멤2','멤3']}],
           '라이즈':[2023,'보이그룹',{'멤버':['쇼타로','은석','성찬','원빈','승한','소희','앤톤']}],
           '투어스':[2024,'보이그룹',{'멤버':['신유','도훈','영재','한진','지훈','경민']}],
           '스테이씨':[2020,'걸그룹',{'멤버':['수민','시은','아이사','세은','윤','재이']}],
           '에스파':[2020,'걸그룹',{'멤버':['카리나','지젤','윈터','닝닝']}],
           '아이브':[2021,'걸그룹',{'멤버':['안유진','가을','레이','장원영','리즈','이서']}],
           '엔믹스':[2022,'걸그룹',{'멤버':['릴리','혜원','설윤','배이','지우','규진']}],
           '르세라핌':[2022,'걸그룹',{'멤버':['사쿠라','김채원','허윤진','카즈하','홍은채']}],
           '이세계아이돌':[2021,'걸그룹',{'멤버':['아이네','징버거','릴파','주르르','고세구','비챤']}],
           '뉴진스':[2022,'걸그룹',{'멤버':['민지','하니','다니엘','해린','혜인']}],
           '베이비몬스터':[2024,'걸그룹',{'멤버':['루카','파리타','아사','아현','라미','로라','치키타']}]}

#세대 결정
def generation(year):
    if year<=1998:
        result='1세대'
    elif year<=2002:
        result='1.5세대'
    elif year<=2008:
        result='2세대'
    elif year<=2011:
        result='2.5세대'
    elif year<=2017:
        result='3세대'
    elif year<=2019:
        result='3.5세대'
    else:
        result='4세대'
    return result    
#초기메뉴
def first_menu():
    print(f'{"-":-^21}')
    print(f'{"|    M  E  N  U     |":20}')
    print(f'{"-":-^21}')
    print(f'{"| 1.그룹명 검색     |":20}')
    print(f'{"| 2.세대별 검색     |":20}')
    print(f'{"| 3.아이돌 멤버 검색|":20}')
    print(f'{"| 4.아이돌 멤버 삭제|":20}')
    print(f'{"| 5.새 그룹 등록요청|":20}')
    print(f'{"| Q.종료            |":20}')
    print(f'{"-":-^21}')
#세대출력
def generation_find(n_gene,Idol_list):
    print(f'{n_gene} 아이돌은',end=' ')
    for group_name in Idol_list:
        if generation(Idol_list[group_name][0])==n_gene:
            print(group_name,end=' ')
    print('이/가 포함되어 있습니다.')
    print(f'{"-":-^50}')

while True:
    first_menu()
    first_in=input('입력:')
    
    if first_in=='1':
        while True:
            print(f'{"-":-^15}')
            print(f'{"|B. 뒤로가기} |":15}')
            print(f'{"-":-^15}')
            find_group=input('그룹명 입력 : ')
            if find_group=='b' or find_group=='B' or find_group=='ㅠ':
                break
            elif find_group not in Idol_list:
                print(f'{find_group}에 대한 정보가 없습니다.')
                print(f'{"-":-^50}')
            else:
                print(f'{find_group}은 {Idol_list[find_group][0]}년도에 데뷔한 {Idol_list[find_group][1]}으로 ',end='')
                for member in Idol_list[find_group][2]['멤버']:
                    print(member,end=' ')
                print('이/가 소속되어있습니다.')
                print(f'{"-":-^50}')

    elif first_in=='2':
        while True:
            print(f'{"-":-^15}')
            print(f'{"| 1. 1세대    |":15}')
            print(f'{"| 2. 1.5세대  |":15}')
            print(f'{"| 3. 2세대    |":15}')
            print(f'{"| 4. 2.5세대  |":15}')
            print(f'{"| 5. 3세대    |":15}')
            print(f'{"| 6. 3.5세대  |":15}')
            print(f'{"| 7. 4세대    |":15}')
            print(f'{"| B. 뒤로가기 |":15}')
            print(f'{"-":-^15}')
            second_in=input('입력 :')
            if second_in=='b' or second_in=='B' or second_in=='ㅠ':
                break
            elif second_in=='1':
                generation_find('1세대',Idol_list)
            elif second_in=='2':
                generation_find('1.5세대',Idol_list)
            elif second_in=='3':
                generation_find('2세대',Idol_list)
            elif second_in=='4':
                generation_find('2.5세대',Idol_list)
            elif second_in=='5':
                generation_find('3세대',Idol_list)
            elif second_in=='6':
                generation_find('3.5세대',Idol_list)
            elif second_in=='7':
                generation_find('4세대',Idol_list)
            else:
                print('잘못된 입력입니다.')
                print(f'{"-":-^50}')

    elif first_in=='3':
        while True:
            print(f'{"-":-^15}')
            print(f'{"|B. 뒤로가기} |":15}')
            print(f'{"-":-^15}')
            name_in=input('이름 입력 : ')
            if name_in=='B' or name_in=='b' or name_in=='ㅠ':
                break
            else: 
                exist=False
                for idol in Idol_list:
                    for mem_name in Idol_list[idol][2]['멤버']:
                        if mem_name==name_in:
                            exist=True
                            print(f'{name_in}은/는 {Idol_list[idol][0]}에 데뷔한 {idol}의 멤버입니다.')
                            print(f'{"-":-^30}')
                if not exist:
                    print(f'{name_in}에 대한 정보가 없습니다.')
                    print(f'{"-":-^50}')

    elif first_in=='4':
        while True:
            print(f'{"-":-^15}')
            print(f'{"|B. 뒤로가기} |":15}')
            print(f'{"-":-^15}')
            delete_group=input('삭제하고 싶은 멤버의 그룹입력 :')
            if delete_group=='B' or delete_group=='b' or delete_group=='ㅠ':
                break
            elif delete_group not in Idol_list:
                print(f'그룹 {delete_group}에 대한 정보가 없습니다.')
                print(f'{"-":-^50}')
                continue
            delete_mem=input('삭제하고 싶은 멤버 입력 : ')
            exist=False
            for mem in Idol_list[delete_group][2]['멤버']:
                if mem==delete_mem:
                    exist=True
                    idx=Idol_list[delete_group][2]['멤버'].index(delete_mem)
                    del Idol_list[delete_group][2]['멤버'][idx]
                    print(f'{delete_group}에서 {delete_mem}이 삭제되었습니다.')
                    print(f'{"-":-^50}')
            if not exist:
                print(f'{delete_mem}은 이미 {delete_group}에 존재하지 않습니다.')
                print(f'{"-":-^50}')


    elif first_in=='5':
        FILE=open('save_new_Idol.txt','w+',encoding='utf-8')
        print('아이돌 정보등록을 관리자에게 요청할수 있습니다.')
        print(f'{"-":-^30}')
        new_groupname=input('그룹 이름을 등록하세요 : ')
        FILE.write(new_groupname)
        FILE.close()



    elif first_in=='q' or first_in=='Q' or first_in=='ㅂ':
        print('아이돌 백과사전을 종료합니다.')
        break

    else: print('잘못된 입력입니다.')























