#-----------------------------------------------------------------------------------------------
# 함수와 변수 - 지역/전역 변수
#-----------------------------------------------------------------------------------------------
## 전역변수(Global Variable)-----------------------------------------------
# - 파일(py)내에 존재하며 모든곳에서 사용가능
# - 프로그램 실행 시 메모리 존재
# - 프로그램 종료시 메모리에서 삭제
##----------------------------------------------------------------------------------------------- 
total=100

## 지역변수(Local Variable)-----------------------------------------------
# - 함수(function)내에 존재하며 모든곳에서 사용가능
# - 함수 실행 시 메모리 존재
# - 함수 종료 시 메모리에서 삭제
##----------------------------------------------------------------------------------------------- 

#-----------------------------------------------------------------------------------------------
# 함수기능 : 정수를 덧셈한 후 결과를 반환하는 함수
# 함수이름 : addint
# 매개변수 : 0개~N개 즉, 가변인자 *num
# 함수결과 : 정수 result
#-----------------------------------------------------------------------------------------------
def addint(*nums):
    total=0
    for i in nums:
        total=total+i
    return total

def multiint(*nums):
    total1=1
    for i in nums:
        total1=total1*i
    return total1+total

def multiint2(*nums):
# 전역변수의 값을 변경할 경우 그냥 사용x
    global total
    for i in nums:
        total=total*i
    return total

result1=addint(1)
print(f'result1={result1}')
result2=multiint(5)
print(f'result2={result2}')
print(f'total={total}')
result3=multiint2(5)
print(f'result3={result3}')
print(f'total={total}')





